Console.Clear();
Console.WriteLine("Bootkemp_Lesson01_Introduction");
Console.WriteLine("");
/*----------------------------------------------------------------------------------- 
Описание программы
Давайте подробнее разберём, что именно вас ждёт на Буткемпе
«Программирование», в чём его отличие от буткемпов на других направлениях и как
устроен процесс обучения.
Чему вы научитесь на буткемп «Программирование»
В рамках программы Буткемп «Программирование» вы погрузитесь в специфику
направления, научитесь работать с новыми языками программирования, искать
информацию и реализуете серию проектов, которые можно использовать для
будущего портфолио и не стыдно будет показать друзьям!
💡 При подготовке программы в направлении «Программирование»,
мы сосредоточили внимание на одной из популярных областей разработки –
веб-разработке.
Веб-разработка – это создание веб-сайтов или приложений для интернета. Это
включает в себя работу с кодом, дизайном и функциональностью страниц.
Разработчики используют разные языки программирования, такие как HTML, CSS,
JavaScript, Python, Java, C# и другие инструменты для того, чтобы сделать сайты
удобными и функциональными.
Веб-разработка, в свою очередь, делится на две основные области: Fronted и
Backend, которые отвечают за разные аспекты создания веб-сайтов и приложений.
1. Фронтенд (Frontend) разработка: фронтенд отвечает за то, как пользователи
взаимодействуют с веб-сайтом или приложением. Фронтенд-разработчики
занимаются созданием пользовательского интерфейса, то есть всем, что
пользователь видит и с чем взаимодействует в браузере или приложении. Это
включает в себя работу с HTML, CSS и JavaScript для создания и стилизации
страниц, а также обеспечение интерактивности и анимации элементов.
2. Бэкенд (Backend) разработка: бэкенд отвечает за работу приложения за
кулисами, то есть за обработку данных и логику работы, которая происходит на
сервере. Бэкенд-разработчики создают серверную часть приложения, которая
взаимодействует с базой данных, обрабатывает запросы от клиентской части и
отправляет данные обратно пользователю. В работе бэкенда используются
различные языки программирования, например, Python, C#, Java, и другие.
4
Содержание программы
Программа буткемпа разделена на два смысловых модуля:
Модуль 1: Основы веб-разработки HTML/CSS
В качестве погружения во фронтенд-разработку вы поработаете с веб-вёрсткой
HTML/CSS, одним из основных инструментов фронтенд-разработчика и реализуете
два проекта: «Виртуальный путеводитель по городу» и «Личный сайт студента
GeekBrains».
Модуль 2: Основы веб-разработки на Python
В качестве погружения в бэкенд-разработку мы предлагаем вам познакомиться с
одним из самых популярных языков программирования – Python. Вы освоите
базовый синтаксис языка, научитесь писать telegram-бот с его помощью,
познакомитесь с понятием «парсинга» сайтов и API. Вы напишете несколько
простых программ на языке python, создадите своего telegram-бота, а также
сможете улучшить его функционал с помощью интеграции с API. В качестве
основного проекта этого модуля вы реализуете telegram-бот «Бот-синоптик»,
который выдаёт прогноз погоды в заданном городе на несколько дней.
5
В каком формате проходит обучение
Занятия буткемпа проходят ежедневно в асинхронном формате. Программа
содержит 26 уроков: вводный урок, два модуля по направлению веб-разработки, о
которых мы писали выше, и заключительный урок.
Каждый модуль содержит 12 уроков: 6 видеоуроков и 6 практических занятий.
6
Видеоуроки построены в формате семинара и включают в себя необходимую
теоретическую базу для выполнения практики, практические задания и их разборы
в виде лайфкодинга. На видео эксперты в области веб-разработки познакомят вас с
особенностями профессии, расскажут необходимую теоретическую базу и покажут,
как использовать основные инструменты для работы над проектами.
Практическое занятие выделено отдельным уроком для того, чтобы вам было
комфортно выделить время и внимание для вашей самостоятельной работы над
проектом. Эти занятия представлены в формате текстового урока (лонгрид),
который включает в себя конспект по теме предыдущего видеоурока и описание
домашнего задания по проекту. С его помощью вы сможете закрепить теорию и
практику видеоурока и уделить больше внимания к реализации проектов.
Как эффективно заниматься на буткемпе
-- Как работать с видео:
📌Посмотрите видео прежде, чем переходить к практическому занятию.
📌Во время просмотра видео повторяйте действия за преподавателем. Такое
активное участие в уроке поможет вам быстрее усвоить и применить новые знания.
📌Перед тем, как посмотреть разбор практического задания, поставьте видео на
паузу и попробуйте выполнить его самостоятельно. После самостоятельного
выполнения задания, обязательно посмотрите, как преподаватель выполняет его, и
проанализируйте своё решение.

-- Как работать с лонгридом:
📌Изучите конспект урока и разборы практических заданий. Если во время
просмотра видео вы не выполняли задания, попробуйте выполнить их
самостоятельно и только после этого изучить разбор задания.
📌В конспекта вам будет предложено выполнить домашнее задание. Выполнение
домашнего задания не является обязательно опцией буткемпа. Однако даже если
выполнение задач не является обязательным, настоятельно рекомендуем вам
воспользоваться этой возможностью для закрепления полученных знаний.
Выполнение практических заданий позволит вам не только применить теорию на
практике, но и расширить свой опыт в области разработки.
7
🔑 Помните, что самостоятельная практика играет ключевую роль в
формировании уверенности в своих способностях и успешном владении
профессиональными навыками.
💡 Проекты в домашних заданиях построены таким образом, что вы можете их
адаптировать под себя, используя описание практики как шаблон.
💡 Вы можете сперва выполнить предлагаемый проект, опираясь на
инструкции и рекомендации из уроков, а затем доработать его с учётом
своих пожеланий. Не бойтесь экспериментировать и проявлять своё
творчество!
----------------------------------------------------------------------------------- */
